notes/tilde-wildcards-and-hidden-files.org
#+title: Tilde, Wildcards and Hidden Files
#+index: 10
#+breadcrumbs: index:/index.html
#+back: << sedf:/sed.html
#+source: https://youtu.be/fAgz66M4aNc?si=ybChoNNggXGZmo8U

* Tilde expansion
Shorthand for a user's home dir.

+ =~/file= for /file/ in current user's home dir
+ =~user/file= for /file/ in specific /user/'s home dir

#+begin_src bash :results output verbatim
ls -l ~/.profile
ls -l ~nasreddin/.profile
#+end_src

#+RESULTS:
: lrwxrwxrwx 1 nasreddin nasreddin 13 Apr 22  2024 /home/nasreddin/.profile -> Dots/.profile
: lrwxrwxrwx 1 nasreddin nasreddin 13 Apr 22  2024 /home/nasreddin/.profile -> Dots/.profile

+ common extensions:
  - =~+= for current dir
  - =~-= for previous dir
+ occurs after var expansion: =~$user= works

#+begin_src bash :results output verbatim
pwd
cd /tmp
echo Now in ~+
echo We were in ~-
#+end_src

#+RESULTS:
: /home/nasreddin/Prog/bash-learning/notes
: Now in /tmp
: We were in /home/nasreddin/Prog/bash-learning/notes


* Wildcarding
Based on REs, but much simpler

+ use wildard for file name and REs for file content
+ =*= matches any sequence of chars (like RE =.*=)
+ =?= matches any single char (like RE =.=)
+ bracket expanssions are like RE's
  - ranges and =[[:class:]]=
  - however, use =[!...]= to complement a set (not =^=)
+ anchoring is implicit: =.c= -> =^.*\.c$=

#+begin_src bash :results output verbatim
ls ./scripts/*.sh
#+end_src

#+RESULTS:
: ./scripts/describe-commands.sh
: ./scripts/error-and-output.sh
: ./scripts/process-args-for.sh
: ./scripts/process-args-while.sh
: ./scripts/quote-tracing-demo-1.sh
: ./scripts/quote-tracing-demo-2.sh
: ./scripts/redirection-prompting.sh
: ./scripts/show-args.sh

* Hidden files
By convention, files whose names start with a dot:
+ are not shown by =ls=
+ are not matched by wildcards

We can:
+ use =ls -a= to see such files ("a" is for "all")
+ use an explicit leading dot to match them

#+begin_src bash :results output verbatim
ls -l ~/.bash*
#+end_src

#+RESULTS:
: -rw-------  1 nasreddin nasreddin 1838 Sep  4 03:05 /home/nasreddin/.bash_history
: -rw-r-xr--+ 1 nasreddin nasreddin   21 Jan 16  2024 /home/nasreddin/.bash_logout
: -rw-r--r--  1 nasreddin nasreddin   78 Apr 22  2024 /home/nasreddin/.bash_profile
: -rw-r--r--  1 nasreddin nasreddin    0 Aug 23 22:06 /home/nasreddin/.bashrc
